In [1]:
import numpy as np
import pandas as pd

np.random.seed(42)
N=4
df1 = pd.DataFrame({'C' : np.random.randn(N),
                    'D' : np.random.randn(N),
                   })
print(df1)

          C         D
0  0.496714 -0.234153
1 -0.138264 -0.234137
2  0.647689  1.579213
3  1.523030  0.767435

In [2]:
df2 = pd.DataFrame({'C' : np.random.randn(N),
                    'D' : np.random.randn(N),
                    'E' : np.random.randn(N),
                   })
print(df2)

          C         D         E
0 -0.469474  0.241962 -1.012831
1  0.542560 -1.913280  0.314247
2 -0.463418 -1.724918 -0.908024
3 -0.465730 -0.562288 -1.412304

In [3]:
df1.multiply(df2)

          C         D   E
0 -0.233195 -0.056656 NaN
1 -0.075017  0.447970 NaN
2 -0.300150 -2.724012 NaN
3 -0.709320 -0.431519 NaN

In [4]:
df1.multiply(df2, fill_value=1)

          C         D         E
0 -0.233195 -0.056656 -1.012831
1 -0.075017  0.447970  0.314247
2 -0.300150 -2.724012 -0.908024
3 -0.709320 -0.431519 -1.412304

Ref:- https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.multiply.html

tags | multiply cell by cell